examples/1.3/oda/docs/diagrams/ODAcomponents_dependant-uml2-component-diagram2.plantuml
@startuml
skinparam componentStyle uml2
skinparam component {
  backgroundColor<<relationship>> White
}

component "my_platform: tmforum:oda_platform_emulator" <<node>> as node_my_platform
interface "feature" as node_my_platform_feature
node_my_platform_feature -- node_my_platform

component "my_sigscale_ocs: tmforum:sigscale_ocs" <<node>> as node_my_sigscale_ocs
interface "feature" as node_my_sigscale_ocs_feature
node_my_sigscale_ocs_feature -- node_my_sigscale_ocs
component ": running_on_emulator" <<relationship>> as node_my_sigscale_ocs_dependency_relationship0
interface " " as node_my_sigscale_ocs_dependency_relationship0_source
node_my_sigscale_ocs_dependency_relationship0_source -- node_my_sigscale_ocs_dependency_relationship0
node_my_sigscale_ocs --( node_my_sigscale_ocs_dependency_relationship0_source : dependency
component ": oda_component_depends_on_TMF_API" <<relationship>> as node_my_sigscale_ocs_TMF632_requirement_relationship1
interface " " as node_my_sigscale_ocs_TMF632_requirement_relationship1_source
node_my_sigscale_ocs_TMF632_requirement_relationship1_source -- node_my_sigscale_ocs_TMF632_requirement_relationship1
node_my_sigscale_ocs --( node_my_sigscale_ocs_TMF632_requirement_relationship1_source : TMF632_requirement

component "my_vodaphone_product_catalog: tmforum:vodaphone_product_catalog" <<node>> as node_my_vodaphone_product_catalog
interface "feature" as node_my_vodaphone_product_catalog_feature
node_my_vodaphone_product_catalog_feature -- node_my_vodaphone_product_catalog
interface "TMF632_capability" as node_my_vodaphone_product_catalog_TMF632_capability
node_my_vodaphone_product_catalog_TMF632_capability -- node_my_vodaphone_product_catalog
component ": running_on_emulator" <<relationship>> as node_my_vodaphone_product_catalog_dependency_relationship0
interface " " as node_my_vodaphone_product_catalog_dependency_relationship0_source
node_my_vodaphone_product_catalog_dependency_relationship0_source -- node_my_vodaphone_product_catalog_dependency_relationship0
node_my_vodaphone_product_catalog --( node_my_vodaphone_product_catalog_dependency_relationship0_source : dependency

node_my_sigscale_ocs_dependency_relationship0 --( node_my_platform_feature
node_my_sigscale_ocs_TMF632_requirement_relationship1 --( node_my_vodaphone_product_catalog_TMF632_capability
node_my_vodaphone_product_catalog_dependency_relationship0 --( node_my_platform_feature
@enduml
